### This further demonstrates use of Python and SQL in extracting and analyzing data.

In [ ]:
## Loading libraries

In [1]:
import pandas as pd
import csv
import sqlite3

In [ ]:
# connect to a database, create an instance, and load.

In [14]:
con = sqlite3.connect("FinalDB.db")

In [3]:
cur = con.cursor()

In [5]:
%load_ext sql

In [11]:
# enable SQL Magic

In [15]:
%sql sqlite:///FinalDB.db

In [16]:
# read csv data from different urls into pandas dataframes
census = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCensusData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01")
school = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoPublicSchools.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01")
crime = pd.read_csv("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBMDeveloperSkillsNetwork-DB0201EN-SkillsNetwork/labs/FinalModule_Coursera_V5/data/ChicagoCrimeData.csv?utm_medium=Exinfluencer&utm_source=Exinfluencer&utm_content=000026UJ&utm_term=10006555&utm_id=NA-SkillsNetwork-Channel-SkillsNetworkCoursesIBMDeveloperSkillsNetworkDB0201ENSkillsNetwork20127838-2021-01-01")

In [18]:
# because we want to check the created dataframes. 
census.head(2)

,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,PERCENT_OF_HOUSING_CROWDED,PERCENT_HOUSEHOLDS_BELOW_POVERTY,PERCENT_AGED_16__UNEMPLOYED,PERCENT_AGED_25__WITHOUT_HIGH_SCHOOL_DIPLOMA,PERCENT_AGED_UNDER_18_OR_OVER_64,PER_CAPITA_INCOME,HARDSHIP_INDEX
0,1.0,Rogers Park,7.7,23.6,8.7,18.2,27.5,23939,39.0
1,2.0,West Ridge,7.8,17.2,8.8,20.8,38.5,23040,46.0

In [19]:
school.head(2)

,School_ID,NAME_OF_SCHOOL,"Elementary, Middle, or High School",Street_Address,City,State,ZIP_Code,Phone_Number,Link,Network_Manager,...,Freshman_on_Track_Rate__,X_COORDINATE,Y_COORDINATE,Latitude,Longitude,COMMUNITY_AREA_NUMBER,COMMUNITY_AREA_NAME,Ward,Police_District,Location
0,610038,Abraham Lincoln Elementary School,ES,615 W Kemper Pl,Chicago,IL,60614,(773) 534-5720,http://schoolreports.cps.edu/SchoolProgressRep...,Fullerton Elementary Network,...,NDA,1171699.458,1915829.428,41.924497,-87.644522,7,LINCOLN PARK,43,18,"(41.92449696, -87.64452163)"
1,610281,Adam Clayton Powell Paideia Community Academy ...,ES,7511 S South Shore Dr,Chicago,IL,60649,(773) 535-6650,http://schoolreports.cps.edu/SchoolProgressRep...,Skyway Elementary Network,...,NDA,1196129.985,1856209.466,41.760324,-87.556736,43,SOUTH SHORE,7,4,"(41.76032435, -87.55673627)"

In [20]:
crime.head(2)

,ID,CASE_NUMBER,DATE,BLOCK,IUCR,PRIMARY_TYPE,DESCRIPTION,LOCATION_DESCRIPTION,ARREST,DOMESTIC,...,DISTRICT,WARD,COMMUNITY_AREA_NUMBER,FBICODE,X_COORDINATE,Y_COORDINATE,YEAR,LATITUDE,LONGITUDE,LOCATION
0,3512276,HK587712,2004-08-28,047XX S KEDZIE AVE,890,THEFT,FROM BUILDING,SMALL RETAIL STORE,False,False,...,9,14.0,58.0,6,1155838.0,1873050.0,2004,41.80744,-87.703956,"(41.8074405, -87.703955849)"
1,3406613,HK456306,2004-06-26,009XX N CENTRAL PARK AVE,820,THEFT,$500 AND UNDER,OTHER,False,False,...,11,27.0,23.0,6,1152206.0,1906127.0,2004,41.89828,-87.716406,"(41.898279962, -87.716405505)"

In [21]:
# because we want to convert the table into SQL table for analysis 
census.to_sql("CENSUS", con, if_exists='replace', index=False, method="multi")

78

In [22]:
census.to_sql("CENSUS", con, if_exists='replace', index=False, method="multi")

78

In [23]:
crime.to_sql("CRIME", con, if_exists='replace', index=False, method="multi")

533

In [24]:
# we want to check the crime table

In [28]:
%%sql
PRAGMA table_info([CRIME]);

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(0, 'ID', 'INTEGER', 0, None, 0),
 (1, 'CASE_NUMBER', 'TEXT', 0, None, 0),
 (2, 'DATE', 'TEXT', 0, None, 0),
 (3, 'BLOCK', 'TEXT', 0, None, 0),
 (4, 'IUCR', 'TEXT', 0, None, 0),
 (5, 'PRIMARY_TYPE', 'TEXT', 0, None, 0),
 (6, 'DESCRIPTION', 'TEXT', 0, None, 0),
 (7, 'LOCATION_DESCRIPTION', 'TEXT', 0, None, 0),
 (8, 'ARREST', 'INTEGER', 0, None, 0),
 (9, 'DOMESTIC', 'INTEGER', 0, None, 0),
 (10, 'BEAT', 'INTEGER', 0, None, 0),
 (11, 'DISTRICT', 'INTEGER', 0, None, 0),
 (12, 'WARD', 'REAL', 0, None, 0),
 (13, 'COMMUNITY_AREA_NUMBER', 'REAL', 0, None, 0),
 (14, 'FBICODE', 'TEXT', 0, None, 0),
 (15, 'X_COORDINATE', 'REAL', 0, None, 0),
 (16, 'Y_COORDINATE', 'REAL', 0, None, 0),
 (17, 'YEAR', 'INTEGER', 0, None, 0),
 (18, 'LATITUDE', 'REAL', 0, None, 0),
 (19, 'LONGITUDE', 'REAL', 0, None, 0),
 (20, 'LOCATION', 'TEXT', 0, None, 0)]

In [31]:
# Finding the total number of crimes recorded in the CRIME table

In [30]:
%%sql
SELECT COUNT(*) FROM CRIME;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(533,)]

In [ ]:
# Listing community area names and numbers with per capita income less than 11000.

In [32]:
%%sql
SELECT COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME FROM CENSUS
WHERE PER_CAPITA_INCOME < 11000;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(26.0, 'West Garfield Park'),
 (30.0, 'South Lawndale'),
 (37.0, 'Fuller Park'),
 (54.0, 'Riverdale')]

In [ ]:
# Listing all case numbers for crimes involving minors (children are not considered minors for the purposes of crime analysis)

In [33]:
%%sql
SELECT COUNT(ID), CASE_NUMBER, DESCRIPTION, PRIMARY_TYPE FROM CRIME
WHERE DESCRIPTION like '%minor%' ORDER BY ID;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(2, 'HL266884', 'SELL/GIVE/DEL LIQUOR TO MINOR', 'LIQUOR LAW VIOLATION')]

In [ ]:
%%sql
SELECT COUNT(ID), CASE_NUMBER, DESCRIPTION, PRIMARY_TYPE FROM CRIME
WHERE DESCRIPTION like '%minor%' ORDER BY ID;

In [34]:
# Determining the number of crimes classified as offense involving children

In [35]:
%%sql
SELECT COUNT(ID) FROM CRIME
WHERE PRIMARY_TYPE = "OFFENSE INVOLVING CHILDREN";

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(4,)]

In [ ]:
# Listing the kind of crimes that were recorded at schools (no repetitions)

In [36]:
%%sql
SELECT PRIMARY_TYPE, LOCATION_DESCRIPTION FROM CRIME
WHERE LOCATION_DESCRIPTION like 'SCHOOL%' GROUP BY PRIMARY_TYPE;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[('ASSAULT', 'SCHOOL, PUBLIC, GROUNDS'),
 ('BATTERY', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL DAMAGE', 'SCHOOL, PUBLIC, GROUNDS'),
 ('CRIMINAL TRESPASS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('NARCOTICS', 'SCHOOL, PUBLIC, GROUNDS'),
 ('PUBLIC PEACE VIOLATION', 'SCHOOL, PRIVATE, BUILDING')]

In [ ]:
# Listing the type of schools along with the average safety score for each type

In [37]:
%%sql
SELECT "Elementary, Middle, or High School", AVG(SAFETY_SCORE) FROM SCHOOL
GROUP BY "Elementary, Middle, or High School";

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[('ES', 49.52038369304557), ('HS', 49.62352941176471), ('MS', 48.0)]

In [ ]:
## the query above can be modified to exclude null by adding WHERE score IS NOT NULL

In [ ]:
# Listing the 5 community areas with highest % of households below poverty line

In [38]:
%%sql
SELECT COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME, PERCENT_HOUSEHOLDS_BELOW_POVERTY FROM CENSUS
ORDER BY PERCENT_HOUSEHOLDS_BELOW_POVERTY DESC LIMIT 5;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(54.0, 'Riverdale', 56.5),
 (37.0, 'Fuller Park', 51.2),
 (68.0, 'Englewood', 46.6),
 (29.0, 'North Lawndale', 43.1),
 (27.0, 'East Garfield Park', 42.4)]

In [ ]:
# Determining the community area that is most crime prone

In [39]:
%%sql
SELECT COMMUNITY_AREA_NUMBER, COUNT(COMMUNITY_AREA_NUMBER) AS CRIME_COUNT FROM CRIME
GROUP BY COMMUNITY_AREA_NUMBER ORDER BY CRIME_COUNT DESC LIMIT 1;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(25.0, 43)]

In [ ]:
# Finding the name of the community area with highest hardship index

In [40]:
%%sql
SELECT COMMUNITY_AREA_NUMBER FROM CENSUS
WHERE HARDSHIP_INDEX = (SELECT MAX(HARDSHIP_INDEX) FROM CENSUS);

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(54.0,)]

In [ ]:
# Finding the Community Area Name with most number of crime

In [41]:
%%sql
SELECT COUNT(ID) AS CRIME_COUNT, R.COMMUNITY_AREA_NUMBER, COMMUNITY_AREA_NAME FROM CRIME R, CENSUS C
WHERE R.COMMUNITY_AREA_NUMBER = C.COMMUNITY_AREA_NUMBER AND R.COMMUNITY_AREA_NUMBER = 25;

 * sqlite:///FinalDB.db
   sqlite:///socioeconomic.db
Done.

[(43, 25.0, 'Austin')]

In [44]:
con.close()

### Author: Paul John Julongbayan